/* (по желанию) Пусть имеется любая таблица с календарным полем created_at. Создайте запрос, который удаляет устаревшие записи из таблицы, 
 * оставляя только 5 самых свежих записей. */

DROP TABLE IF EXISTS any_table;
CREATE TABLE IF NOT EXISTS any_table(
id SERIAL PRIMARY KEY,
name VARCHAR(255),
created_at DATE NOT NULL
);
INSERT INTO `any_table` VALUES (1,'dolores','2006-02-05'),(2,'eligendi','2019-09-05'),(3,'porro','2013-10-14'),
(4,'et','1998-03-16'),(5,'repudiandae','1973-02-15'),(6,'in','2007-06-18'),(7,'consequuntur','2019-10-23'),
(8,'rem','2016-03-13'),(9,'quidem','1974-01-02'),(10,'sapiente','1991-06-08'),(11,'delectus','1989-03-15'),
(12,'aliquam','1979-11-07'),(13,'aperiam','2012-05-17'),(14,'saepe','2010-04-12'),(15,'consequatur','1988-10-26'),
(16,'repellendus','1970-07-01'),(17,'est','2011-07-19'),(18,'nobis','1980-03-23'),(19,'molestiae','1977-02-07'),
(20,'voluptatem','2002-05-27'),(21,'vero','1993-03-23'),(22,'odio','2010-10-20'),(23,'qui','1988-12-18'),
(24,'molestias','1994-09-28'),(25,'cum','1981-06-09'),(26,'repellat','2012-07-30'),(27,'rerum','2002-08-06'),
(28,'beatae','2009-12-05'),(29,'voluptatibus','2002-12-20'),(30,'commodi','1993-03-28'),(31,'culpa','1988-07-20'),
(32,'dolorem','2015-03-19'),(33,'qui','1978-08-31'),(34,'rerum','2016-08-22'),(35,'illo','1990-04-12'),
(36,'explicabo','2018-11-20'),(37,'cum','1983-10-15'),(38,'omnis','1992-11-30'),(39,'molestiae','2005-12-04'),
(40,'in','2017-09-18'),(41,'animi','1984-09-13'),(42,'laboriosam','2012-07-28'),(43,'ipsa','2020-03-14'),(44,'atque','2005-06-05'),
(45,'consequatur','1980-09-18'),(46,'sint','2002-03-10'),(47,'maiores','2008-03-07'),(48,'aliquam','1977-04-17'),
(49,'architecto','2018-07-21'),(50,'enim','1985-04-26'),(51,'quibusdam','2018-04-14'),(52,'dolores','1989-10-31'),
(53,'quasi','1974-12-16'),(54,'nemo','2015-05-18'),(55,'est','1992-12-19'),(56,'voluptates','1977-09-13'),
(57,'autem','2010-03-24'),(58,'ut','1975-08-30'),(59,'sed','2000-07-02'),(60,'molestiae','1974-05-26'),(61,'omnis','2019-09-05'),
(62,'velit','2012-01-28'),(63,'quos','1987-08-14'),(64,'in','1996-07-04'),(65,'eligendi','2001-08-11'),(66,'quis','2015-11-14'),
(67,'est','2000-08-10'),(68,'earum','2010-10-16'),(69,'libero','2003-12-03'),(70,'aut','1985-07-31'),(71,'et','1991-04-22'),
(72,'aut','1999-04-05'),(73,'et','1996-08-14'),(74,'deleniti','1982-01-04'),(75,'saepe','2011-08-11'),(76,'ea','2016-04-15'),
(77,'tempora','1987-09-21'),(78,'ut','2013-04-19'),(79,'reprehenderit','1974-08-28'),(80,'ut','2004-03-06'),(81,'sint','1972-04-30'),
(82,'eum','2005-04-04'),(83,'sed','1989-12-03'),(84,'vel','2015-09-04'),(85,'corrupti','1991-12-06'),(86,'quo','1974-09-21'),
(87,'deleniti','1999-12-30'),(88,'quisquam','2012-09-16'),(89,'ipsum','2021-09-14'),(90,'dolorem','1984-12-22'),
(91,'expedita','1991-03-19'),(92,'et','1970-03-28'),(93,'voluptas','1979-02-23'),(94,'porro','2002-11-23'),(95,'omnis','2000-05-11'),
(96,'nulla','2013-04-20'),(97,'fugit','1970-06-15'),(98,'saepe','1991-04-23'),(99,'ducimus','2019-11-20'),(100,'accusamus','2014-04-13');

SELECT * FROM any_table;

START TRANSACTION;

DELETE FROM any_table ORDER BY created_at LIMIT 95;

COMMIT;

SELECT * FROM any_table;
